In [2]:
pip install pandas

Requirement already satisfied: pandas in c:\users\kalpe\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\kalpe\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\kalpe\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\kalpe\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\kalpe\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\kalpe\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [6]:
import pandas as pd

orders = pd.read_csv("orders.csv")

In [20]:
orders.head(10)

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name
0,1,2508,450,18-02-2023,842.97,New Foods Chinese
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian
5,6,2933,499,12-07-2023,1497.22,Annapurna Tiffins South Indian
6,7,970,35,30-05-2023,129.21,Royal Biryani North Indian
7,8,891,57,07-11-2023,269.19,Spice Mess Punjabi
8,9,364,7,05-12-2023,953.30,Ruchi Biryani Punjabi
9,10,2972,183,30-12-2023,351.41,Taste of Biryani Non-Veg

In [12]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   order_id         10000 non-null  int64
 1   user_id          10000 non-null  int64
 2   restaurant_id    10000 non-null  int64
 3   order_date       10000 non-null  object
 4   total_amount     10000 non-null  float64
 5   restaurant_name  10000 non-null  object
dtypes: float64(1), int64(3), object(2)
memory usage: 468.9+ KB

In [18]:
users = pd.read_json("users.json")
users.head(10)

   user_id     name       city membership
0        1   User_1    Chennai    Regular
1        2   User_2       Pune       Gold
2        3   User_3  Bangalore       Gold
3        4   User_4  Bangalore    Regular
4        5   User_5       Pune       Gold
5        6   User_6       Pune       Gold
6        7   User_7    Chennai       Gold
7        8   User_8  Hyderabad    Regular
8        9   User_9  Bangalore       Gold
9       10  User_10    Chennai    Regular

In [22]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     3000 non-null   int64
 1   name        3000 non-null   object
 2   city        3000 non-null   object
 3   membership  3000 non-null   object
dtypes: int64(1), object(3)
memory usage: 93.9+ KB

In [54]:
# Create a temporary SQLite DB
import sqlite3

conn = sqlite3.connect("restaurants.db")
cursor = conn.cursor()

# Execute the SQL file
with open("restaurants.sql", "r") as file:
    sql_script = file.read()

cursor.executescript(sql_script)
conn.commit()

# Load SQL table into Pandas
restaurants = pd.read_sql("SELECT * FROM restaurants", conn)

# Run code
restaurants.head()

OperationalError: table restaurants already exists

In [52]:
restaurants.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   restaurant_id    500 non-null    int64
 1   restaurant_name  500 non-null    object
 2   cuisine          500 non-null    object
 3   rating           500 non-null    float64
dtypes: float64(1), int64(1), object(2)
memory usage: 15.8+ KB

In [56]:
orders_users = orders.merge(
    users,
    on="user_id",
    how="left"
)

In [58]:
final_df = orders_users.merge(
    restaurants,
    on="restaurant_id",
    how="left"
)

In [60]:
final_df.head()
final_df.info()
final_df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   order_id           10000 non-null  int64
 1   user_id            10000 non-null  int64
 2   restaurant_id      10000 non-null  int64
 3   order_date         10000 non-null  object
 4   total_amount       10000 non-null  float64
 5   restaurant_name_x  10000 non-null  object
 6   name               10000 non-null  object
 7   city               10000 non-null  object
 8   membership         10000 non-null  object
 9   restaurant_name_y  10000 non-null  object
 10  cuisine            10000 non-null  object
 11  rating             10000 non-null  float64
dtypes: float64(2), int64(3), object(7)
memory usage: 937.6+ KB

order_id             0
user_id              0
restaurant_id        0
order_date           0
total_amount         0
restaurant_name_x    0
name                 0
city                 0
membership           0
restaurant_name_y    0
cuisine              0
rating               0
dtype: int64

In [64]:
final_df.head(11)

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0
5,6,2933,499,12-07-2023,1497.22,Annapurna Tiffins South Indian,User_2933,Chennai,Regular,Restaurant_499,Mexican,4.9
6,7,970,35,30-05-2023,129.21,Royal Biryani North Indian,User_970,Bangalore,Regular,Restaurant_35,Chinese,3.9
7,8,891,57,07-11-2023,269.19,Spice Mess Punjabi,User_891,Pune,Regular,Restaurant_57,Mexican,4.4
8,9,364,7,05-12-2023,953.30,Ruchi Biryani Punjabi,User_364,Chennai,Gold,Restaurant_7,Italian,3.2
9,10,2972,183,30-12-2023,351.41,Taste of Biryani Non-Veg,User_2972,Bangalore,Regular,Restaurant_183,Chinese,3.7
10,11,924,235,10-12-2023,523.82,Amma Delights Family Restaurant,User_924,Chennai,Regular,Restaurant_235,Italian,4.5

In [66]:
final_df.to_csv("final_food_delivery_dataset.csv", index=False)

In [70]:
import os

os.listdir()

['.ipynb_checkpoints',
 'final_food_delivery_dataset.csv',
 'orders.csv',
 'restaurants.db',
 'restaurants.sql',
 'test.ipynb',
 'Untitled.ipynb',
 'users.json']

# ALl MCQ

In [27]:
import pandas as pd

df = pd.read_csv("final_food_delivery_dataset.csv")
df

results = {}

In [45]:
# Q1) City with highest total revenue from Gold members

df[df["membership"]=="Gold"] \
  .groupby("city")["total_amount"] \
  .sum() \
  .sort_values(ascending=False)

city
Chennai      1080909.79
Pune         1003012.32
Bangalore     994702.59
Hyderabad     896740.19
Name: total_amount, dtype: float64

In [49]:
# Q.2) Which cuisine has the highest average order value across all orders?
df.groupby("cuisine")["total_amount"] \
  .mean() \
  .sort_values(ascending=False)

cuisine
Mexican    808.021344
Italian    799.448578
Indian     798.466011
Chinese    798.389020
Name: total_amount, dtype: float64

In [51]:
# Q.3) How many distinct users spent more than ₹1000 in total?
(df.groupby("user_id")["total_amount"].sum() > 1000).sum()

2544

In [53]:
# Q.4) Which restaurant rating range generated the highest revenue?
import pandas as pd

bins = [0, 3.5, 4.0, 4.5, 5.0]
labels = ["3.0–3.5", "3.6–4.0", "4.1–4.5", "4.6–5.0"]

df["rating_range"] = pd.cut(df["rating"], bins=bins, labels=labels)

df.groupby("rating_range")["total_amount"] \
  .sum() \
  .sort_values(ascending=False)

C:\Users\kalpe\AppData\Local\Temp\ipykernel_6608\4065302336.py:9: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby("rating_range")["total_amount"] \

rating_range
4.6–5.0    2197030.75
3.0–3.5    2136772.70
4.1–4.5    1960326.26
3.6–4.0    1717494.41
Name: total_amount, dtype: float64

In [55]:
# Q.5) Among Gold members, which city has the highest average order value?
df[df["membership"] == "Gold"] \
  .groupby("city")["total_amount"] \
  .mean() \
  .sort_values(ascending=False)

city
Chennai      808.459080
Hyderabad    806.421034
Bangalore    793.223756
Pune         781.162243
Name: total_amount, dtype: float64

In [57]:
# Q.6) Cuisine with lowest restaurants but significant revenue
df.groupby("cuisine")["restaurant_id"].nunique(), \
df.groupby("cuisine")["total_amount"].sum()

(cuisine
 Chinese    120
 Indian     126
 Italian    126
 Mexican    128
 Name: restaurant_id, dtype: int64,
 cuisine
 Chinese    1930504.65
 Indian     1971412.58
 Italian    2024203.80
 Mexican    2085503.09
 Name: total_amount, dtype: float64)

In [59]:
# Q.7) Percentage of total orders placed by Gold members
round(
    (df[df["membership"] == "Gold"].shape[0] / df.shape[0]) * 100
)

50

In [61]:
# Q.8) Highest average order value but < 20 orders
df.groupby("restaurant_name_y") \
  .agg(
      avg_order=("total_amount", "mean"),
      orders=("order_id", "count")
  ) \
  .query("orders < 20") \
  .sort_values("avg_order", ascending=False) \
  .head()

                     avg_order  orders
restaurant_name_y
Restaurant_294     1040.222308      13
Restaurant_262     1029.473333      18
Restaurant_77      1029.180833      12
Restaurant_193     1026.306667      15
Restaurant_7       1002.140625      16

In [63]:
# Q.9) Which combination contributes highest revenue?
df.groupby(["membership", "cuisine"])["total_amount"] \
  .sum() \
  .sort_values(ascending=False)

membership  cuisine
Regular     Mexican    1072943.30
            Italian    1018424.75
Gold        Mexican    1012559.79
            Italian    1005779.05
Regular     Indian      992100.27
Gold        Indian      979312.31
            Chinese     977713.74
Regular     Chinese     952790.91
Name: total_amount, dtype: float64

In [65]:
# 10) During which quarter is total revenue highest?
df["order_date"] = pd.to_datetime(df["order_date"], dayfirst=True)
df["quarter"] = df["order_date"].dt.to_period("Q")

df.groupby("quarter")["total_amount"] \
  .sum() \
  .sort_values(ascending=False)

quarter
2023Q3    2037385.10
2023Q4    2018263.66
2023Q1    1993425.14
2023Q2    1945348.72
2024Q1      17201.50
Freq: Q-DEC, Name: total_amount, dtype: float64

# Numerical Answers

In [74]:
# Q1: Total orders by Gold members
df[df["membership"] == "Gold"].shape[0]

4987

In [76]:
# Q.2: Total revenue from Hyderabad (rounded to nearest integer)
round(df[df["city"] == "Hyderabad"]["total_amount"].sum())

1889367

In [80]:

# Q3: Distinct users with at least one order
df["user_id"].nunique()

2883

In [82]:
# Q4: Average order value for Gold members (rounded to 2 decimals)
round(df[df["membership"] == "Gold"]["total_amount"].mean(), 2)

797.15

In [84]:

# Q5: Orders placed for restaurants with rating >= 4.5
df[df["rating"] >= 4.5].shape[0]

3374

In [88]:
# Q6: Orders in top revenue city among Gold members
top_gold_city = (
    df[df["membership"] == "Gold"]
    .groupby("city")["total_amount"]
    .sum()
    .idxmax()
)

df[(df["membership"] == "Gold") & (df["city"] == top_gold_city)].shape[0]

1337